/**
* 隐藏属性数组
*/
var HdProp = [
	"与裁判争论",
	"避免使用逆足",
	"抢断高手",
	"45度传中高手",
	"天赋",
	"门将单刀防守",
	"易受伤",
	"领导力",
	"精准长传",
	"远射",
	"远距离手抛球",
	"稳固可靠",
	"外脚背射门",
	"进攻组织者",
	"强力头球",
	"拳击球",
	"独狼",
	"团队球员",
	"盘球大师",
	"反越位",
	"参与角球",
	"精准直塞",
	"擅扑点球",
	"大力任意球",
	"超远界外球",
	"远距离界外球",
	"大力界外球",
	"精准射门",
	"高速带球"
];

/**
* 国家数组
*/
var Country = [
	{
		"id": 1,
		"name": "欧洲",
		"countries": [
			"希腊",
			"荷兰",
			"挪威",
			"丹麦",
			"德国"
		]
	}, {
		"id": 2,
		"name": "南美洲",
		"countries": [
			"巴西",
			"阿根廷"
		]
	}, {
		"id": 3,
		"name": "亚洲",
		"countries": [
			"韩国",
			"日本"
		]
	}, {
		"id": 4,
		"name": "非洲",
		"countries": [
			"科特迪瓦"
		]
	}, {
		"id": 5,
		"name": "中北美洲加勒比海",
		"countries": [
			"墨西哥"
		]
	}, {
		"id": 6,
		"name": "大洋洲",
		"countries": [
			"澳大利亚"
		]
	}
];

/**
* 联赛数据
*/
var Matches = [
	{	
		"id": 1,
		"name": "西班牙足球甲级联赛",
		"team": [
			{
				"id": 1,
				"name": "皇家马德里"
			}, {
				"id": 2,
				"name": "巴塞罗那"
			}, {
				"id": 3,
				"name": "马德里竞技"
			}, {
				"id": 4,
				"name": "塞维利亚"
			}, {
				"id": 5,
				"name": "巴伦西亚"
			}, {
				"id": 6,
				"name": "比利亚雷亚尔"
			}, {
				"id": 7,
				"name": "马拉加"
			}, {
				"id": 8,
				"name": "塞尔塔"
			}, {
				"id": 9,
				"name": "埃瓦尔"
			}, {
				"id": 10,
				"name": "毕尔巴鄂竞技"
			}, {
				"id": 11,
				"name": "巴列卡诺"
			}, {
				"id": 12,
				"name": "赫塔菲"
			}, {
				"id": 13,
				"name": "皇家社会"
			}, {
				"id": 14,
				"name": "莱万特"
			}, {
				"id": 15,
				"name": "格拉纳达"
			}, {
				"id": 16,
				"name": "阿尔梅里亚"
			}, {
				"id": 17,
				"name": "科尔多瓦"
			}, {
				"id": 18,
				"name": "阿尔梅里亚"
			}, {
				"id": 19,
				"name": "拉科鲁里亚"
			}, {
				"id": 20
				"name": "艾尔切"
			}			
		]
	}, {
		"id": 2,
		"name": "德国足球甲级联赛",
		"team": [
			{	
				"id": 1,
				"name": "拜仁慕尼黑"
			}, {
				"id": 2,
				"name": "沃尔夫斯堡"
			}, {
				"id": 3,
				"name": "奥格斯堡"
			}, {
				"id": 4,
				"name": "勒沃库森"
			}, {
				"id": 5,
				"name": "沙尔克04"
			}, {
				"id": 6,
				"name": "门兴格拉德巴赫"
			}, {
				"id": 7,
				"name": "法兰克福"
			}, {
				"id": 8,
				"name": "霍芬海姆"
			}, {
				"id": 9,
				"name": "汉诺威96"
			}, {
				"id": 10,
				"name": "帕德博恩"
			}, {
				"id": 11,
				"name": "美因茨"
			}, {
				"id": 12,
				"name": "科隆"
			}, {
				"id": 13,
				"name": "汉堡"
			}, {
				"id": 14,
				"name": "多特蒙德"
			}, {
				"id": 15,
				"name": "柏林赫塔"
			}, {
				"id": 16,
				"name": "弗莱堡"
			}, {
				"id": 17,
				"name": "云达不莱梅"
			}, {
				"id": 18,
				"name": "斯图加特"
			}
		]
	}, {
		"id": 3,
		"name": "英格兰足球超级联赛"
		"team": [
			{
				"id": 1,
				"name": "切尔西"
			}, {
				"id": ,
				"name": "曼特斯特城"
			}, {
				"id": 3,
				"name": "曼特斯特联"
			}, {
				"id": 4,
				"name": "西汉姆联"
			}, {
				"id": 5,
				"name": "南安普顿"
			}, {
				"id": 6,
				"name": "阿森纳"
			}, {
				"id": 7,
				"name": "纽卡斯尔联"
			}, {
				"id": 8,
				"name": "斯旺西"
			}, {
				"id": 9,
				"name": "利物浦"
			}, {
				"id": 10,
				"name": "托特纳姆热刺"
			}, {
				"id": 11,
				"name": "阿斯顿维拉"
			}, {
				"id": 12,
				"name": "埃佛顿"
			}, {
				"id": 13,
				"name": "斯托克城"
			}, {
				"id": 14,
				"name": "桑德兰"
			}, {
				"id": 15,
				"name": "水晶宫"
			}, {
				"id": 16,
				"name": "西布罗姆维奇"
			}, {
				"id": 17,
				"name": "女王公园巡游者"
			}, {
				"id": 18,
				"name": "赫尔城"
			}, {
				"id": 19,
				"name": "伯恩利"
			}, {
				"id": 20,
				"name": "莱切斯特城"
			}
		]
	}, {
		"id": 4,
		"name": "意大利足球甲级联赛",
		"team": [
			{
				"id": 1,
				"name": "尤文图斯"
			}, {
				"id": 2,
				"name": "罗马"
			}, {
				"id": 3,
				"name": "热那亚"
			}, {
				"id": 4,
				"name": "桑普多利亚"
			}, {
				"id": 5,
				"name": "那不勒斯"
			}, {
				"id": 6,
				"name": "拉齐奥"
			}, {
				"id": 7,
				"name": "AC米兰"
			}, {
				"id": 8,
				"name": "乌迪内斯"
			}, {
				"id": 9,
				"name": "佛罗伦萨"
			}, {
				"id": 10,
				"name": "森索罗"
			}, {
				"id": 11,
				"name": "巴勒莫"
			}, {
				"id": 12,
				"name": "国际米兰"
			}, {
				"id": 13,
				"name": "恩波利"
			}, {
				"id": 14,
				"name": "亚特兰大"
			}, {
				"id": 15,
				"name": "维罗纳"
			}, {
				"id": 16,
				"name": "切沃"
			}, {
				"id": 17,
				"name": "都灵"
			}, {
				"id": 18,
				"name": "卡利亚里"
			}, {
				"id": 19,
				"name": "切塞纳"
			}, {
				"id": 20,
				"name": "帕尔马"
			}
		]
	}, {
		"id": 5,
		"name": "法国足球甲级联赛",
		"team": [
			{
				"id": 1,
				"name": "巴黎圣日耳曼"
			}, {
				"id": 2,
				"name": "马赛 "
			}, {
				"id": 3,
				"name": "里昂"
			}, {
				"id": 4,
				"name": "圣埃蒂安"
			}, {
				"id": 5,
				"name": "波尔多"
			}, {
				"id": 6,
				"name": "雷恩"
			}, {
				"id": 7,
				"name": "摩纳哥"
			}, {
				"id": 8,
				"name": "蒙彼利埃"
			}, {
				"id": 9,
				"name": "南特"
			}, {
				"id": 10,
				"name": "兰斯"
			}, {
				"id": 11,
				"name": "尼斯"
			}, {
				"id": 12,
				"name": "图卢兹"
			}, {
				"id": 13,
				"name": "梅斯"
			}, {
				"id": 14,
				"name": "伊维恩"
			}, {
				"id": 15,
				"name": "里尔"
			}, {
				"id": 16,
				"name": "甘冈"
			}, {
				"id": 17,
				"name": "洛里昂"
			}, {
				"id": 18,
				"name": "朗斯"
			}, {
				"id": 19,
				"name": "巴斯蒂亚"
			}, {
				"id": 20,
				"name": "卡昂"
			}
		]
	}, {
		"id": 6,
		"name" "荷兰足球甲级联赛",
		"team": [
			{
				"id": 1,
				"name": "埃因霍恩"
			}, {
				"id": 2,
				"name": "阿贾克斯"
			}, {
				"id": 3,
				"name": "费耶诺德"
			}, {
				"id": 4,
				"name": "艾尔克马尔"
			}, {
				"id": 5,
				"name": "泽沃勒"
			}, {
				"id": 6,
				"name": "特温特"
			}, {
				"id": 7,
				"name": "格罗宁根"
			}, {
				"id": 8,
				"name": "坎布尔"
			}, {
				"id": 9,
				"name": "威廉二世"
			}, {
				"id": 10,
				"name": "乌得勒支"
			}, {
				"id": 11,
				"name": "维迪斯"
			}, {
				"id": 12,
				"name": "海伦芬"
			}, {
				"id": 13,
				"name": "赫拉克莱斯"
			}, {
				"id": 14,
				"name": "前进之鹰"
			}, {
				"id": 15,
				"name": "SBV精英"
			}, {
				"id": 16,
				"name": "海牙"
			}, {
				"id": 17,
				"name": "布雷达"
			}, {
				"id": 18,
				"name": "多德勒支"
			}
		]
	}, {
		"id": 7,
		"name" "比利时足球甲级联赛",
		"team": [
			{
				"id": 1,
				"name": "布鲁日"
			}, {
				"id": 2,
				"name": "根特"
			}, {
				"id": 3,
				"name": "科特赖克"
			}, {
				"id": 4,
				"name": "安德莱赫特"
			}, {
				"id": 5,
				"name": "洛克伦"
			}, {
				"id": 6,
				"name": "亨克"
			}, {
				"id": 7,
				"name": "标准列日"
			}, {
				"id": 8,
				"name": "沙勒罗瓦"
			}, {
				"id": 9,
				"name": "奥斯坦德"
			}, {
				"id": 10,
				"name": "匹卢维兹"
			}, {
				"id": 11,
				"name": "梅赫伦"
			}, {
				"id": 12,
				"name": "韦斯特鲁"
			}, {
				"id": 13,
				"name": "华斯兰德"
			}, {
				"id": 14,
				"name": "威尔郡"
			}, {
				"id": 15,
				"name": "色格拉布鲁日"
			}, {
				"id": 16,
				"name": "利尔斯"
			}
		]
	}, {
		"id": ,
		"name" "",
		"team": [
			{
				"id": 1,
				"name": ""
			}, {
				"id": 2,
				"name": ""
			}, {
				"id": 3,
				"name": ""
			}, {
				"id": 4,
				"name": ""
			}, {
				"id": 5,
				"name": ""
			}, {
				"id": 6,
				"name": ""
			}, {
				"id": 7,
				"name": ""
			}, {
				"id": 8,
				"name": ""
			}, {
				"id": 9,
				"name": ""
			}, {
				"id": 10,
				"name": ""
			}, {
				"id": 11,
				"name": ""
			}, {
				"id": 12,
				"name": ""
			}, {
				"id": 13,
				"name": ""
			}, {
				"id": 14,
				"name": ""
			}, {
				"id": 15,
				"name": ""
			}, {
				"id": 16,
				"name": ""
			}, {
				"id": 17,
				"name": ""
			}, {
				"id": 18,
				"name": ""
			}, {
				"id": 19,
				"name": ""
			}, {
				"id": 20,
				"name": ""
			}
		]
	}, {
		"id": ,
		"name" "",
		"team": [
			{
				"id": 1,
				"name": ""
			}, {
				"id": 2,
				"name": ""
			}, {
				"id": 3,
				"name": ""
			}, {
				"id": 4,
				"name": ""
			}, {
				"id": 5,
				"name": ""
			}, {
				"id": 6,
				"name": ""
			}, {
				"id": 7,
				"name": ""
			}, {
				"id": 8,
				"name": ""
			}, {
				"id": 9,
				"name": ""
			}, {
				"id": 10,
				"name": ""
			}, {
				"id": 11,
				"name": ""
			}, {
				"id": 12,
				"name": ""
			}, {
				"id": 13,
				"name": ""
			}, {
				"id": 14,
				"name": ""
			}, {
				"id": 15,
				"name": ""
			}, {
				"id": 16,
				"name": ""
			}, {
				"id": 17,
				"name": ""
			}, {
				"id": 18,
				"name": ""
			}, {
				"id": 19,
				"name": ""
			}, {
				"id": 20,
				"name": ""
			}
		]
	}, {
		"id": ,
		"name" "",
		"team": [
			{
				"id": 1,
				"name": ""
			}, {
				"id": 2,
				"name": ""
			}, {
				"id": 3,
				"name": ""
			}, {
				"id": 4,
				"name": ""
			}, {
				"id": 5,
				"name": ""
			}, {
				"id": 6,
				"name": ""
			}, {
				"id": 7,
				"name": ""
			}, {
				"id": 8,
				"name": ""
			}, {
				"id": 9,
				"name": ""
			}, {
				"id": 10,
				"name": ""
			}, {
				"id": 11,
				"name": ""
			}, {
				"id": 12,
				"name": ""
			}, {
				"id": 13,
				"name": ""
			}, {
				"id": 14,
				"name": ""
			}, {
				"id": 15,
				"name": ""
			}, {
				"id": 16,
				"name": ""
			}, {
				"id": 17,
				"name": ""
			}, {
				"id": 18,
				"name": ""
			}, {
				"id": 19,
				"name": ""
			}, {
				"id": 20,
				"name": ""
			}
		]
	}, {
		"id": ,
		"name" "",
		"team": [
			{
				"id": 1,
				"name": ""
			}, {
				"id": 2,
				"name": ""
			}, {
				"id": 3,
				"name": ""
			}, {
				"id": 4,
				"name": ""
			}, {
				"id": 5,
				"name": ""
			}, {
				"id": 6,
				"name": ""
			}, {
				"id": 7,
				"name": ""
			}, {
				"id": 8,
				"name": ""
			}, {
				"id": 9,
				"name": ""
			}, {
				"id": 10,
				"name": ""
			}, {
				"id": 11,
				"name": ""
			}, {
				"id": 12,
				"name": ""
			}, {
				"id": 13,
				"name": ""
			}, {
				"id": 14,
				"name": ""
			}, {
				"id": 15,
				"name": ""
			}, {
				"id": 16,
				"name": ""
			}, {
				"id": 17,
				"name": ""
			}, {
				"id": 18,
				"name": ""
			}, {
				"id": 19,
				"name": ""
			}, {
				"id": 20,
				"name": ""
			}
		]
	}
];